espressif/esp-idf/components/soc/esp32s31/register/soc/mcpwm_reg.h
/** MCPWM_OP0_TSTMP_E2_REG register
 *  Generator0 timer stamp E2 value register
 */
#define MCPWM_OP0_TSTMP_E2_REG(i) (REG_MCPWM_BASE(i) + 0x12c)
/** MCPWM_OP0_TSTMP_E2 : R/W; bitpos: [15:0]; default: 0;
 *  Configures generator0 timer stamp E2 value register
 */
#define MCPWM_OP0_TSTMP_E2    0x0000FFFFU
#define MCPWM_OP0_TSTMP_E2_M  (MCPWM_OP0_TSTMP_E2_V << MCPWM_OP0_TSTMP_E2_S)
#define MCPWM_OP0_TSTMP_E2_V  0x0000FFFFU
#define MCPWM_OP0_TSTMP_E2_S  0

/** MCPWM_OP1_TSTMP_E1_REG register
 *  Generator1 timer stamp E1 value register
 */
#define MCPWM_OP1_TSTMP_E1_REG(i) (REG_MCPWM_BASE(i) + 0x130)
/** MCPWM_OP1_TSTMP_E1 : R/W; bitpos: [15:0]; default: 0;
 *  Configures generator1 timer stamp E1 value register
 */
#define MCPWM_OP1_TSTMP_E1    0x0000FFFFU
#define MCPWM_OP1_TSTMP_E1_M  (MCPWM_OP1_TSTMP_E1_V << MCPWM_OP1_TSTMP_E1_S)
#define MCPWM_OP1_TSTMP_E1_V  0x0000FFFFU
#define MCPWM_OP1_TSTMP_E1_S  0

/** MCPWM_OP1_TSTMP_E2_REG register
 *  Generator1 timer stamp E2 value register
 */
#define MCPWM_OP1_TSTMP_E2_REG(i) (REG_MCPWM_BASE(i) + 0x134)
/** MCPWM_OP1_TSTMP_E2 : R/W; bitpos: [15:0]; default: 0;
 *  Configures generator1 timer stamp E2 value register
 */
#define MCPWM_OP1_TSTMP_E2    0x0000FFFFU
#define MCPWM_OP1_TSTMP_E2_M  (MCPWM_OP1_TSTMP_E2_V << MCPWM_OP1_TSTMP_E2_S)
#define MCPWM_OP1_TSTMP_E2_V  0x0000FFFFU
#define MCPWM_OP1_TSTMP_E2_S  0

/** MCPWM_OP2_TSTMP_E1_REG register
 *  Generator2 timer stamp E1 value register
 */
#define MCPWM_OP2_TSTMP_E1_REG(i) (REG_MCPWM_BASE(i) + 0x138)
/** MCPWM_OP2_TSTMP_E1 : R/W; bitpos: [15:0]; default: 0;
 *  Configures generator2 timer stamp E1 value register
 */
#define MCPWM_OP2_TSTMP_E1    0x0000FFFFU
#define MCPWM_OP2_TSTMP_E1_M  (MCPWM_OP2_TSTMP_E1_V << MCPWM_OP2_TSTMP_E1_S)
#define MCPWM_OP2_TSTMP_E1_V  0x0000FFFFU
#define MCPWM_OP2_TSTMP_E1_S  0

/** MCPWM_OP2_TSTMP_E2_REG register
 *  Generator2 timer stamp E2 value register
 */
#define MCPWM_OP2_TSTMP_E2_REG(i) (REG_MCPWM_BASE(i) + 0x13c)
/** MCPWM_OP2_TSTMP_E2 : R/W; bitpos: [15:0]; default: 0;
 *  Configures generator2 timer stamp E2 value register
 */
#define MCPWM_OP2_TSTMP_E2    0x0000FFFFU
#define MCPWM_OP2_TSTMP_E2_M  (MCPWM_OP2_TSTMP_E2_V << MCPWM_OP2_TSTMP_E2_S)
#define MCPWM_OP2_TSTMP_E2_V  0x0000FFFFU
#define MCPWM_OP2_TSTMP_E2_S  0

/** MCPWM_CLK_REG register
 *  Global configuration register
 */
#define MCPWM_CLK_REG(i) (REG_MCPWM_BASE(i) + 0x140)
/** MCPWM_CLK_EN : R/W; bitpos: [0]; default: 0;
 *  Configures whether or not to open register clock gate.
 *  0: Open the clock gate only when application writes registers
 *  1: Force open the clock gate for register
 */
#define MCPWM_CLK_EN    (BIT(0))
#define MCPWM_CLK_EN_M  (MCPWM_CLK_EN_V << MCPWM_CLK_EN_S)
#define MCPWM_CLK_EN_V  0x00000001U
#define MCPWM_CLK_EN_S  0

/** MCPWM_VERSION_REG register
 *  Version register.
 */
#define MCPWM_VERSION_REG(i) (REG_MCPWM_BASE(i) + 0x144)
/** MCPWM_DATE : R/W; bitpos: [27:0]; default: 37761424;
 *  Configures the version.
 */
#define MCPWM_DATE    0x0FFFFFFFU
#define MCPWM_DATE_M  (MCPWM_DATE_V << MCPWM_DATE_S)
#define MCPWM_DATE_V  0x0FFFFFFFU
#define MCPWM_DATE_S  0

/** MCPWM_TIMER0_CFG2_REG register
 *  PWM timer0 timestamp a configuration register.
 */
#define MCPWM_TIMER0_CFG2_REG(i) (REG_MCPWM_BASE(i) + 0x14c)
/** MCPWM_TIMER0_A : R/W; bitpos: [15:0]; default: 255;
 *  Configures the timestamp a shadow of PWM timer0
 */
#define MCPWM_TIMER0_A    0x0000FFFFU
#define MCPWM_TIMER0_A_M  (MCPWM_TIMER0_A_V << MCPWM_TIMER0_A_S)
#define MCPWM_TIMER0_A_V  0x0000FFFFU
#define MCPWM_TIMER0_A_S  0
/** MCPWM_TIMER0_A_UPMETHOD : R/W; bitpos: [17:16]; default: 0;
 *  Configures the update method for active register of PWM timer0 timestamp a.
 *  0: Immediate
 *  1: TEZ
 *  2: Sync
 *  3: TEZ or sync
 *  TEZ here and below means timer equal zero event
 */
#define MCPWM_TIMER0_A_UPMETHOD    0x00000003U
#define MCPWM_TIMER0_A_UPMETHOD_M  (MCPWM_TIMER0_A_UPMETHOD_V << MCPWM_TIMER0_A_UPMETHOD_S)
#define MCPWM_TIMER0_A_UPMETHOD_V  0x00000003U
#define MCPWM_TIMER0_A_UPMETHOD_S  16
/** MCPWM_TIMER0_A_DIR : R/W; bitpos: [18]; default: 0;
 *  Configures the direction of the timer when timer0 value equal a value for event
 *  trigger.
 *  0: up
 *  1: down
 */
#define MCPWM_TIMER0_A_DIR    (BIT(18))
#define MCPWM_TIMER0_A_DIR_M  (MCPWM_TIMER0_A_DIR_V << MCPWM_TIMER0_A_DIR_S)
#define MCPWM_TIMER0_A_DIR_V  0x00000001U
#define MCPWM_TIMER0_A_DIR_S  18

/** MCPWM_TIMER0_CFG3_REG register
 *  PWM timer0 timestamp b configuration register.
 */
#define MCPWM_TIMER0_CFG3_REG(i) (REG_MCPWM_BASE(i) + 0x150)
/** MCPWM_TIMER0_B : R/W; bitpos: [15:0]; default: 255;
 *  Configures the timestamp b shadow of PWM timer0
 */
#define MCPWM_TIMER0_B    0x0000FFFFU
#define MCPWM_TIMER0_B_M  (MCPWM_TIMER0_B_V << MCPWM_TIMER0_B_S)
#define MCPWM_TIMER0_B_V  0x0000FFFFU
#define MCPWM_TIMER0_B_S  0
/** MCPWM_TIMER0_B_UPMETHOD : R/W; bitpos: [17:16]; default: 0;
 *  Configures the update method for active register of PWM timer0 timestamp b.
 *  0: Immediate
 *  1: TEZ
 *  2: Sync
 *  3: TEZ or sync
 *  TEZ here and below means timer equal zero event
 */
#define MCPWM_TIMER0_B_UPMETHOD    0x00000003U
#define MCPWM_TIMER0_B_UPMETHOD_M  (MCPWM_TIMER0_B_UPMETHOD_V << MCPWM_TIMER0_B_UPMETHOD_S)
#define MCPWM_TIMER0_B_UPMETHOD_V  0x00000003U
#define MCPWM_TIMER0_B_UPMETHOD_S  16
/** MCPWM_TIMER0_B_DIR : R/W; bitpos: [18]; default: 0;
 *  Configures the direction of the timer when timer0 value equal b value for event
 *  trigger.
 *  0: up
 *  1: down
 */
#define MCPWM_TIMER0_B_DIR    (BIT(18))
#define MCPWM_TIMER0_B_DIR_M  (MCPWM_TIMER0_B_DIR_V << MCPWM_TIMER0_B_DIR_S)
#define MCPWM_TIMER0_B_DIR_V  0x00000001U
#define MCPWM_TIMER0_B_DIR_S  18

/** MCPWM_TIMER1_CFG2_REG register
 *  PWM timer1 timestamp a configuration register.
 */
#define MCPWM_TIMER1_CFG2_REG(i) (REG_MCPWM_BASE(i) + 0x154)
/** MCPWM_TIMER1_A : R/W; bitpos: [15:0]; default: 255;
 *  Configures the timestamp a shadow of PWM timer1
 */
#define MCPWM_TIMER1_A    0x0000FFFFU
#define MCPWM_TIMER1_A_M  (MCPWM_TIMER1_A_V << MCPWM_TIMER1_A_S)
#define MCPWM_TIMER1_A_V  0x0000FFFFU
#define MCPWM_TIMER1_A_S  0
/** MCPWM_TIMER1_A_UPMETHOD : R/W; bitpos: [17:16]; default: 0;
 *  Configures the update method for active register of PWM timer1 timestamp a.
 *  0: Immediate
 *  1: TEZ
 *  2: Sync
 *  3: TEZ or sync
 *  TEZ here and below means timer equal zero event
 */
#define MCPWM_TIMER1_A_UPMETHOD    0x00000003U
#define MCPWM_TIMER1_A_UPMETHOD_M  (MCPWM_TIMER1_A_UPMETHOD_V << MCPWM_TIMER1_A_UPMETHOD_S)
#define MCPWM_TIMER1_A_UPMETHOD_V  0x00000003U
#define MCPWM_TIMER1_A_UPMETHOD_S  16
/** MCPWM_TIMER1_A_DIR : R/W; bitpos: [18]; default: 0;
 *  Configures the direction of the timer when timer1 value equal a value for event
 *  trigger.
 *  0: up
 *  1: down
 */
#define MCPWM_TIMER1_A_DIR    (BIT(18))
#define MCPWM_TIMER1_A_DIR_M  (MCPWM_TIMER1_A_DIR_V << MCPWM_TIMER1_A_DIR_S)
#define MCPWM_TIMER1_A_DIR_V  0x00000001U
#define MCPWM_TIMER1_A_DIR_S  18

