espressif/esp-idf/components/soc/esp32s31/register/soc/mcpwm_reg.h
/** MCPWM_TIMER1_CFG3_REG register
 *  PWM timer1 timestamp b configuration register.
 */
#define MCPWM_TIMER1_CFG3_REG(i) (REG_MCPWM_BASE(i) + 0x158)
/** MCPWM_TIMER1_B : R/W; bitpos: [15:0]; default: 255;
 *  Configures the timestamp b shadow of PWM timer1
 */
#define MCPWM_TIMER1_B    0x0000FFFFU
#define MCPWM_TIMER1_B_M  (MCPWM_TIMER1_B_V << MCPWM_TIMER1_B_S)
#define MCPWM_TIMER1_B_V  0x0000FFFFU
#define MCPWM_TIMER1_B_S  0
/** MCPWM_TIMER1_B_UPMETHOD : R/W; bitpos: [17:16]; default: 0;
 *  Configures the update method for active register of PWM timer1 timestamp b.
 *  0: Immediate
 *  1: TEZ
 *  2: Sync
 *  3: TEZ or sync
 *  TEZ here and below means timer equal zero event
 */
#define MCPWM_TIMER1_B_UPMETHOD    0x00000003U
#define MCPWM_TIMER1_B_UPMETHOD_M  (MCPWM_TIMER1_B_UPMETHOD_V << MCPWM_TIMER1_B_UPMETHOD_S)
#define MCPWM_TIMER1_B_UPMETHOD_V  0x00000003U
#define MCPWM_TIMER1_B_UPMETHOD_S  16
/** MCPWM_TIMER1_B_DIR : R/W; bitpos: [18]; default: 0;
 *  Configures the direction of the timer when timer1 value equal b value for event
 *  trigger.
 *  0: up
 *  1: down
 */
#define MCPWM_TIMER1_B_DIR    (BIT(18))
#define MCPWM_TIMER1_B_DIR_M  (MCPWM_TIMER1_B_DIR_V << MCPWM_TIMER1_B_DIR_S)
#define MCPWM_TIMER1_B_DIR_V  0x00000001U
#define MCPWM_TIMER1_B_DIR_S  18

/** MCPWM_TIMER2_CFG2_REG register
 *  PWM timer2 timestamp a configuration register.
 */
#define MCPWM_TIMER2_CFG2_REG(i) (REG_MCPWM_BASE(i) + 0x15c)
/** MCPWM_TIMER2_A : R/W; bitpos: [15:0]; default: 255;
 *  Configures the timestamp a shadow of PWM timer2
 */
#define MCPWM_TIMER2_A    0x0000FFFFU
#define MCPWM_TIMER2_A_M  (MCPWM_TIMER2_A_V << MCPWM_TIMER2_A_S)
#define MCPWM_TIMER2_A_V  0x0000FFFFU
#define MCPWM_TIMER2_A_S  0
/** MCPWM_TIMER2_A_UPMETHOD : R/W; bitpos: [17:16]; default: 0;
 *  Configures the update method for active register of PWM timer2 timestamp a.
 *  0: Immediate
 *  1: TEZ
 *  2: Sync
 *  3: TEZ or sync
 *  TEZ here and below means timer equal zero event
 */
#define MCPWM_TIMER2_A_UPMETHOD    0x00000003U
#define MCPWM_TIMER2_A_UPMETHOD_M  (MCPWM_TIMER2_A_UPMETHOD_V << MCPWM_TIMER2_A_UPMETHOD_S)
#define MCPWM_TIMER2_A_UPMETHOD_V  0x00000003U
#define MCPWM_TIMER2_A_UPMETHOD_S  16
/** MCPWM_TIMER2_A_DIR : R/W; bitpos: [18]; default: 0;
 *  Configures the direction of the timer when timer2 value equal a value for event
 *  trigger.
 *  0: up
 *  1: down
 */
#define MCPWM_TIMER2_A_DIR    (BIT(18))
#define MCPWM_TIMER2_A_DIR_M  (MCPWM_TIMER2_A_DIR_V << MCPWM_TIMER2_A_DIR_S)
#define MCPWM_TIMER2_A_DIR_V  0x00000001U
#define MCPWM_TIMER2_A_DIR_S  18

/** MCPWM_TIMER2_CFG3_REG register
 *  PWM timer2 timestamp b configuration register.
 */
#define MCPWM_TIMER2_CFG3_REG(i) (REG_MCPWM_BASE(i) + 0x160)
/** MCPWM_TIMER2_B : R/W; bitpos: [15:0]; default: 255;
 *  Configures the timestamp b shadow of PWM timer2
 */
#define MCPWM_TIMER2_B    0x0000FFFFU
#define MCPWM_TIMER2_B_M  (MCPWM_TIMER2_B_V << MCPWM_TIMER2_B_S)
#define MCPWM_TIMER2_B_V  0x0000FFFFU
#define MCPWM_TIMER2_B_S  0
/** MCPWM_TIMER2_B_UPMETHOD : R/W; bitpos: [17:16]; default: 0;
 *  Configures the update method for active register of PWM timer2 timestamp b.
 *  0: Immediate
 *  1: TEZ
 *  2: Sync
 *  3: TEZ or sync
 *  TEZ here and below means timer equal zero event
 */
#define MCPWM_TIMER2_B_UPMETHOD    0x00000003U
#define MCPWM_TIMER2_B_UPMETHOD_M  (MCPWM_TIMER2_B_UPMETHOD_V << MCPWM_TIMER2_B_UPMETHOD_S)
#define MCPWM_TIMER2_B_UPMETHOD_V  0x00000003U
#define MCPWM_TIMER2_B_UPMETHOD_S  16
/** MCPWM_TIMER2_B_DIR : R/W; bitpos: [18]; default: 0;
 *  Configures the direction of the timer when timer2 value equal b value for event
 *  trigger.
 *  0: up
 *  1: down
 */
#define MCPWM_TIMER2_B_DIR    (BIT(18))
#define MCPWM_TIMER2_B_DIR_M  (MCPWM_TIMER2_B_DIR_V << MCPWM_TIMER2_B_DIR_S)
#define MCPWM_TIMER2_B_DIR_V  0x00000001U
#define MCPWM_TIMER2_B_DIR_S  18

#ifdef __cplusplus
}
#endif
